bench-bnb/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "steven"], ["LIMIT", 1]]
---
  def self.find_by_credentials(username,password)
    user = User.find_by(username: username)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "tM8Bx-YklPgf03QUe2u6MA"], ["updated_at", "2018-12-10 18:13:54.747330"], ["id", 1]]
---
  def reset_session_token
    self.session_token = SecureRandom.urlsafe_base64
    self.save