bench-bnb/app/controllers/api/benches_controller.rb

  def index

    # coords = {
    #   ne_lng: params[:bounds][:northEast][:lng],
    #   sw_lng: params[:bounds][:southWest][:lng],
    #   ne_lat: params[:bounds][:northEast][:lat],
    #   sw_lat: params[:bounds][:southWest][:lat]
    # }

    # query = "lng <= :sw_lng AND lng >= :ne_lng AND lat <= :ne_lat AND lat >= :sw_lat"

    # @benches = Bench.where(query, coords)
    @benches = Bench.all
---
SELECT "benches".* FROM "benches" WHERE (lng >= '-122.534543' AND lng <= '-122.381032' AND lat <= '37.821726' AND lat >= '37.696329')

  def create
    @bench = Bench.new(bench_params)
    if @bench.save
---
INSERT INTO "benches" ("description", "lat", "lng", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "this is a new bench that I created"], ["lat", 37.720594], ["lng", -122.41463], ["created_at", "2018-12-10 19:19:18.808482"], ["updated_at", "2018-12-10 19:19:18.808482"]]